Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Vim also has useful features for editing single-line paragraphs and tables.
es_es: Vim también ofrece útiles características para editar párrafos de una sola línea y tablas-

source: If you type "l" next, this makes the line longer than the 30-character limit.
es_es: Si teclea ahora «os», la línea sobrepasaría el límite de 30 caracteres.

source: When Vim sees this, it inserts a line break and you get the following:
es_es: En cuanto Vim detecta esto, inserta un salto línea, obteniendo lo siguiente:

source: The Vim editor is not a word processor.
es_es: El editor Vim no es un editor de documentos.

source: In a word processor, if you delete something at the beginning of the paragraph, the line breaks are reworked.
es_es: En un editor de documentos, si elimina algo al inicio del párrafo, se reorganizan los saltos de línea.

source: In Vim they are not; so if you delete the word "programming" from the first line, all you get is a short line:
es_es: No es así en Vim; así que se borra la palabra «programación» en la primera línea, obtendría los siguiente:

source: This does not look good.
es_es: Esto no es elegante.

source: To get the paragraph into shape you use the "gq" operator.
es_es: Para dar formato a un párrafo puede usar el operador «gq».

source: Let's first use this with a Visual selection.
es_es: Usemos esto primero con una selección en modo Visual.

source: Starting from the first line, type: >
es_es: Empezando por la primera línea, escriba: >

source: "v" to start Visual mode, "4j' to move to the end of the paragraph and then the "gq" operator.
es_es: «v» inicial el modo Visual, «4j» para desplazarse al final del párrafo, y después el operador «gq».

source: "ap" stands for "a-paragraph".
es_es: «ap» significa un párrafo («a-paragraph»).

source: This formats the text of one paragraph (separated by empty lines).
es_es: Esto da formato al texto de un párrafo (separado por líneas vacías).

source: Also the part before the cursor.
es_es: También el área anterior al cursor.

source: If you have your paragraphs separated by empty lines, you can format the whole file by typing this: >
es_es: Si los párrafos están separados por líneas vacías, puede dar formato a todo el archivo con lo siguiente: >

source: "gg" to move to the first line, "gqG" to format until the last line.
es_es: «gg» para ir a la primera línea, «gqG» para dar formato hasta la última línea.

source: Warning: If your paragraphs are not properly separated, they will be joined together.
es_es: Aviso: si sus párrafos no están apropiadamente separados, no se unirán.

source: A common mistake is to have a line with a space or tab.
es_es: Un error común es tener una línea con un espacio o tabulación.

source: That's a blank line, but not an empty line.
es_es: Esa es una línea en blanco, pero no una línea vacía.

source: Vim is able to format more than just plain text.
es_es: Vim es capaz de dar formato a más que texto.

source: See |fo-table| for how to change this.
es_es: Consulte |fo-table| para ver cómo cambiar esto.

source: See the 'joinspaces' option to change the number of spaces used after a full stop.
es_es: Consulte la opción 'joinspaces' para modificar el número de espacios antes de un punto final.

source: It is possible to use an external program for formatting.
es_es: Es posible dar formato con un programa externo.

source: This is useful if your text can't be properly formatted with Vim's builtin command.
es_es: Esto es útil si el texto no puede recibir un formato adecuado con la orden integrada en Vim.

source: See the 'formatprg' option.
es_es: Consulte la opción 'formatprg'.

source: {range} is the usual command-line range.
es_es: {range} (rango) is el valor de rango normal en la línea de órdenes.

source: [width] is an optional line width to use for centering.
es_es: [width] (ancho) es el valor opcional del ancho usado al centrar.

source: If [width] is not specified, it defaults to the value of 'textwidth'.
es_es: De no especificar [width], su valor por omisión será el de 'textwidth'.

source: (If 'textwidth' is 0, the default is 80.) For example: >
es_es: (Si 'textwith' es cero, el valor será 80.) Por ejemplo: >

source: Vim has no built-in way of justifying text.
es_es: Vim no posee una herramienta integrada para justificar texto.

source: However, there is a neat macro package that does the job.
es_es: Por otro lado, ofrece un excelente macro que realiza esta labor.

source: To use this package, execute the following command: >
es_es: Ejecute la siguiente orden para usar este conjunto: >

source: This Vim script file defines a new visual command "_j".
es_es: Este archivo script de Vim define una nueva orden visual, «_j».

source: To justify a block of text, highlight the text in Visual mode and then execute "_j".
es_es: Para justificar un bloque de texto, resalte el texto en modo Visual y ejecute «_j».

source: Look in the file for more explanations.
es_es: Consulte el archivo para una explicación más completa.

source: To go there, do "gf" on this name: $VIMRUNTIME/macros/justify.vim.
es_es: Para ir a ese punto, pulse «gf» en este nombre: $VIMRUNTIME/macros/justify.vim.

source: An alternative is to filter the text through an external program.
es_es: Una alternativa es filtrar el texto a través de un programa externo.

source: Indents can be used to make text stand out from the rest.
es_es: Puede usar el sangrado para destacar texto con respecto al resto.

source: The example texts in this manual, for example, are indented by eight spaces or a tab.
es_es: Los textos de ejemplo en este manual, por ejemplo, están sangrados con ocho espacios, o una tabulación.

source: You would normally enter this by typing a tab at the start of each line.
es_es: Generalmente, introduce el sangrado con una tabulación al inicio de cada línea.

source: Take this text: the first line ~ the second line ~
es_es: Suponga este texto: la primera línea ~ la segunda línea ~

source: This is entered by typing a tab, some text, <Enter>, tab and more text.
es_es: Puede introducir esto pulsando el botón de tabulado, algo de texto, <Intro>, tabulado, y más texto.

source: The 'autoindent' option inserts indents automatically: >
es_es: La opción 'autoindent' inserta sangrado automáticamente: >

source: When a new line is started it gets the same indent as the previous line.
es_es: Al iniciar una nueva línea, este recibirá el mismo sangrado que la línea anterior.

source: In the above example, the tab after the <Enter> is not needed anymore.
es_es: En el ejemplo anterior, el tabulado tras <Intro> ya no es necesario.

source: To increase the amount of indent in a line, use the ">" operator.
es_es: Para aumentar la cantidad de sangrado en una línea, use el operador «>».

source: Often this is used as ">>", which adds indent to the current line.
es_es: A menudo usará esto como «>>», que añade sangrado a la línea actual.

source: The amount of indent added is specified with the 'shiftwidth' option.
es_es: La cantidad de sangrado añadida se especifica con la opción 'shiftwidth'.

source: The default value is 8.
es_es: El valor por omisión es 8.

source: To make ">>" insert four spaces worth of indent, for example, type this: >
es_es: Para lograr que «>>» inserte cuatro espacios de sangrado, por ejemplo, use lo siguiente: >

source: If you want to make indents a multiple of 4, you set 'shiftwidth' to 4.
es_es: Si desea que el sangrado sea un múltiplo de 4, defina 'shiftwidth' a 4.

source: But when pressing a <Tab> you still get 8 spaces worth of indent.
es_es: Aún obtendría ocho espacios de sangrado al pulsar <Tab>.

source: To change this, set the 'softtabstop' option: >
es_es: Defina la opción 'softtabstop' para modificar esto: >

source: This will make the <Tab> key insert 4 spaces worth of indent.
es_es: Esto hará que la tecla <Tab> inserte 4 espacios de sangrado.

source: If there are already four spaces, a <Tab> character is used (saving seven characters in the file).
es_es: EL carácter <Tab> se usará en caso ya existir cuatro espacios (ahorrando 7 espacios en el archivo).

source: (If you always want spaces and no tab characters, set the 'expandtab' option.)
es_es: (Si desea siempre espacios y no caracteres de tabulado, defina la opción 'expandtab').

source: Note: You could set the 'tabstop' option to 4.
es_es: Nota: Puede definir la opción 'tabstop' con valor de 4.

source: However, if you edit the file another time, with 'tabstop' set to the default value of 8, it will look wrong.
es_es: De todas formas, si edita el archivo en otro momento teniendo 'tabstop' su valor predeterminado de 8, el aspecto no será el deseado.

source: In other programs and when printing the indent will also be wrong.
es_es: Otros programas, así como imprimir el sangrado presentarán un aspecto equivocado.

source: Therefore it is recommended to keep 'tabstop' at eight all the time.
es_es: Por ello, recomendamos mantener 'tabstop' con valor de 8 en todo momento.

source: That's the standard value everywhere.
es_es: Este es el valor estándar en otras aplicaciones.

source: The ":retab" command will change 'tabstop' to 8, while changing the text such that it looks the same.
es_es: La orden «:retab» cambia 'tabstop' a 8, a la vez que modifica el texto para que encaje.

source: It changes spans of white space into tabs and spaces for this.
es_es: Para ello, modifica los tramos de espacio blanco a tabulados y espacios.

source: You can now write the file.
es_es: Ahora puede escribir en el archivo.

source: Next time you edit it the indents will be right without setting an option.
es_es: La siguiente vez que lo edite, la tabulación será la correcta sin necesidad de definir la opción.

source: Warning: When using ":retab" on a program, it may change white space inside a string constant.
es_es: Aviso: Si usa «:retab» sobre un programa, cabe que modifique el espacio en blanco dentro de una cadena entrecomillas.

# Therefore it's a good habit to use " " instead of a real tab.
source: Therefore it's a good habit to use "\t" instead of a real tab.
es_es: Por ello, es una buena costumbre usar «\t» en lugar de un tabulado real.

source: If you don't have a scrollbar or don't want to use it, use these commands to scroll the text.
es_es: Si no tiene una barra de desplazamiento o no quiere usarla, puede usar estas órdenes para desplazar el texto.

source: The cursor will stay in the same place, but it's moved back into the visible text if necessary.
es_es: El cursor permanecerá en el mismo lugar, pero permitiendo también desplazarlo al texto visible, de ser necesario.

source: Let's attempt to show this with one line of text.
es_es: Vamos a intentar mostrar esto con una línea de texto.

source: The cursor is on the "w" of "which".
es_es: El cursor está sobre la «w» de «which».

source: The "current window" above the line indicates the text that is currently visible.
es_es: La «ventana actual» sobre la línea indica el texto actualmente visible.

source: The "window"s below the text indicate the text that is visible after the command left of it.
es_es: Las «ventana» bajo el texto indican el texto visible después de ejecutar la orden.

source: When 'wrap' is off and the text has scrolled horizontally, you can use the following commands to move the cursor to a character you can see.
es_es: Cuando ha desplazado el texto horizontalmente y 'wrap' está desactivado, puede usar las siguientes órdenes para mover el cursor a un carácter que puede ver.

source: Thus text left and right of the window is ignored.
es_es: Por ello, se ignorará el texto a la izquierda y derecha de la ventana.

source: These never cause the text to scroll:
es_es: Esto nunca causa un desplazamiento del texto:

source: When preparing text for use by another program, you might have to make paragraphs without a line break.
es_es: Cuando prepara el texto para su uso con otro programa, puede que tenga que crear los párrafos sin salto de línea.

source: A disadvantage of using 'nowrap' is that you can't see the whole sentence you are working on.
es_es: Una desventaja de usar 'nowrap' es que no puede ver la oración completa sobre la que trabaja.

source: When 'wrap' is on, words are broken halfway, which makes them hard to read.
es_es: Si 'wrap' está, activada, las palabras se dividen por la mitad, dificultando la lectura.

source: A good solution for editing this kind of paragraph is setting the 'linebreak' option.
es_es: Una buena solución para editar este tipo de párrafos es definir la opción 'linebreak'.

source: Vim then breaks lines at an appropriate place when displaying the line.
es_es: Vim dividirá las líneas en los puntos apropiados al mostrar la línea.

source: The text in the file remains unchanged.
es_es: El texto en el archivo no se modifica.

source: Without 'linebreak' text might look like this:
es_es: Sin 'linebreak', el texto presentará este aspecto:

source: Unfo| |rtunately for the programmer, he | +---------------------------------+ After: >
es_es: Unfo| |rtunately for the programmer, he | +---------------------------------+ Después: >

source: Related options: 'breakat' specifies the characters where a break can be inserted.
es_es: Opciones relacionadas: 'breakat' especifica los caracteres donde insertar el salto de línea.

source: 'showbreak' specifies a string to show at the start of broken line.
es_es: 'showbreak' especifica una cadena a mostrar al principio de una línea dividida.

source: Set 'textwidth' to zero to avoid a paragraph to be split.
es_es: Defina 'textwitdh' como cero para evitar dividir un párrafo.

source: The "j" and "k" commands move to the next and previous lines.
es_es: Las órdenes «j» y «k» desplazan el cursor.

source: When used on a long line, this means moving a lot of screen lines at once.
es_es: Esto desplaza varias líneas en la pantalla en caso de usarlo sobre una larga línea.

source: To move only one screen line, use the "gj" and "gk" commands.
es_es: Para desplazarse sólo una línea en la pantalla, use las órdenes «gj» y «gk».

source: When a line doesn't wrap they do the same as "j" and "k".
es_es: Estas órdenes hacen lo mismo que «j» y «k» si la línea no está justificada.

source: When the line does wrap, they move to a character displayed one line below or above.
es_es: De activar 'wrap', se desplazan a un carácter visible en una línea inferior o superior.

source: You might like to use these mappings, which bind these movement commands to the cursor keys: >
es_es: Puede que desee usar estas macros, que relacionan estas órdenes de desplazamiento a las teclas de cursor: >

source: If you want to import text into a program like MS-Word, each paragraph should be a single line.
es_es: Si desea importar texto desde un programa como MS-Word, cada párrafo debería ser una sola línea.

source: If your paragraphs are currently separated with empty lines, this is how you turn each paragraph into a single line: >
es_es: De existir una separación entre los párrafos en forma de de líneas vacías, debe realizar lo siguiente para convertir cada párrafo en una sola línea: >

source: That looks complicated.
es_es: Parece complicado.

source: Let's break it up in pieces:
es_es: Vamos a dividirlo:

source: :g/./ A ":global" command that finds all lines that contain at least one character.
es_es: :g/./ Una orden «:global» que encuentra todas las cadenas que contienen al menos un carácter.

source: ,/^$/ A range, starting from the current line (the non-empty line) until an empty line.
es_es: ,/^$/ Un rango, que empieza en la línea actual (no vacía), y acaba en una línea vacía.

source: join The ":join" command joins the range of lines together into one line.
es_es: join La orden «:join» (unir) une el rango de líneas en una sola línea.

source: Note that this doesn't work when the separating line is blank but not empty; when it contains spaces and/or tabs.
es_es: Tenga en cuenta que esto no funciona si la línea de separación está en blanco, pero no vacía; cuando contiene espacios y/o tabulados.

source: This command does work with blank lines: > :g/\S/,/^\s*$/join
es_es: Esta orden funciona con líneas en blanco: > :g/\S/,/^\s*$/join

source: You need to enter numbers in the third column.
es_es: Necesita introducir números en la tercera columna.

source: You could move to the second line, use "A", enter a lot of spaces and type the text.
es_es: Podría desplazarse a la segunda línea, usar «A», introducir espacios y escribir el texto.

source: For this kind of editing there is a special option: >
es_es: Existe una orden especial para este tipo de edición: >

source: Now press "j" and you are right where you can enter the value for "input A".
es_es: Pulse ahora «j» y estará dónde puede introducir el valor para «input A».

source: Typing "0.693" results in:
es_es: Teclear «0.693» da como resultado:

source: Vim has automatically filled the gap in front of the new text for you.
es_es: Vim a rellenado automáticamente el espacio en frente del texto.

source: Now, to enter the next field in this column use "Bj".
es_es: Ahora, para introducir el siguiente campo de esta columna use «Bj».

source: "B" moves back to the start of a white space separated word.
es_es: «B» le devuelve al inicio de una palabra separada por un espacio en blanco.

source: Then "j" moves to the place where the next field can be entered.
es_es: «j» le desplaza al lugar dónde puede introducir el siguiente campo.

source: Note: You can move the cursor anywhere in the display, also beyond the end of a line.
es_es: Nota: Puede mover el cursor a cualquier lugar de la pantalla, también más allá del final de línea.

source: But Vim will not insert spaces there, until you insert a character in that position.
es_es: Pero Vim no insertará aquí espacios hasta que inserte un carácter en esa posición.

source: You want to add a column, which should be a copy of the third column and placed before the "test 1" column.
es_es: Si desea añadir una columna, que debe ser la copia de la tercera columna y deberá situarse antes de la columna «test 1».

source: Do this in seven steps: 1.
es_es: Haga estos 7 pasos: 1.

source: Move the cursor to the left upper corner of this column, e.g., with "/test 3". 2.
es_es: Mueva el cursor a la esquina superior izquierda de esta columna, p. ej., con «/test 3». 2.

source: Press CTRL-V to start blockwise Visual mode. 3.
es_es: Pulse CTRL-V para empezar el modo de bloque visual. 3.

source: Move the cursor down two lines with "2j".
es_es: Mueva el cursor dos líneas hacia abajo con «2j».

source: You are now in "virtual space": the "input B" line of the "test 3" column. 4.
es_es: Ahora se encuentra en espacio virtual («virtual space»): la línea «entrada B» de la columna «test 3». 4.

source: Move the cursor right, to include the whole column in the selection, plus the space that you want between the columns.
es_es: Mueva el cursor a la derecha para incluir toda la columna en la selección además del espacio que desea entre las columnas.

source: "9l" should do it. 5.
es_es: «9l» hará esto. 5.

source: Yank the selected rectangle with "y". 6.
es_es: Copie el rectángulo seleccionado con «y» (yank). 6.

source: Move the cursor to "test 1", where the new column must be placed. 7.
es_es: Mueva el cursor a «test 1», donde se debería situar la nueva columna. 7.

source: Press "P".
es_es: Pulse «P».

source: The disadvantage of using 'virtualedit' is that it "feels" different.
es_es: La desventaja de usar 'virtualedit' es que parece distinto.

source: You can't recognize tabs or spaces beyond the end of line when moving the cursor around.
es_es: No puede reconocer tabulados o espacios más allá del final de línea si desplaza el cursor.

source: Another method can be used: Virtual Replace mode.
es_es: Puede usar otro método: Modo Virtual de Reemplazar.

source: Suppose you have a line in a table that contains both tabs and other characters.
es_es: Suponga que tiene una línea en una tabla que contienen tabulados y otros caracteres.

source: Use "rx" on the first tab:
es_es: Use «rx» en el primer tabulado:

source: The layout is messed up.
es_es: EL diseño está desordenado.

source: To avoid that, use the "gr" command:
es_es: Use la orden «gr» para evitarlo:

source: What happens is that the "gr" command makes sure the new character takes the right amount of screen space.
es_es: Lo que ocurre es que la orden «gr» se asegura que el nuevo carácter tomará la cantidad de espacio de pantalla correcta.

source: Extra spaces or tabs are inserted to fill the gap.
es_es: Los espacios y tabulados adicionales se insertarán en el hueco.

source: Thus what actually happens is that a tab is replaced by "x" and then blanks added to make the text after it keep its place.
es_es: Por ello, lo que realmente ocurre es que el tabulado se reemplaza por «x», y después se añaden espacios en blanco para que el texto a continuación siga en el mismo sitio.

source: In this case a tab is inserted.
es_es: En este caso se inserta un tabulado.

source: When you need to replace more than one character, you use the "R" command to go to Replace mode (see |04.9|).
es_es: Cuando necesita reemplazar más de un carácter, use la orden «R» para pasar al modo Reemplazar (consulte |04.9|).

source: This messes up the layout and replaces the wrong characters:
es_es: Esto desordena la presentación y reemplaza los caracteres erróneos:

source: The "gR" command uses Virtual Replace mode.
es_es: La orden «gR» usa el modo Virtual Reemplazar.

source: This preserves the layout:
es_es: Esto respeta el diseño:

source: *usr_09.txt* For Vim version 7.3.
es_es: *usr_09.esx* Para Vim versión 7.3.

source: Vim works in an ordinary terminal.
es_es: Vim funciona en una terminal normal.

source: GVim can do the same things and a few more.
es_es: GVim puede hacer las mismas cosas y algunas más.

source: The GUI offers menus, a toolbar, scrollbars and other items.
es_es: La interfaz gráfica ofrece menús, una barra de menú, barras de desplazamiento y otros.

source: This chapter is about these extra things that the GUI offers.
es_es: Este capítulo trata de las funcionalidades adicionales que la interfaz gráfica ofrece.

source: You might have an icon on your desktop that starts gVim.
es_es: Puede que tenga un icono en su escritorio que arranca gVim.

source: Otherwise, one of these commands should do it: >
es_es: En caso contrario, una de estas órdenes lo hará: >

source: If this doesn't work you don't have a version of Vim with GUI support.
es_es: Si esto no funciona es que no tiene la versión de Vim con soporte para GUI.

source: You will have to install one first.
es_es: Tendrá que instalar una primero.

source: Vim will open a window and display "file.txt" in it.
es_es: Vim abrirá una ventana y mostrará «archivo.txt».

source: What the window looks like depends on the version of Vim.
es_es: El aspecto de la ventana dependerá de la versión de Vim.

source: It should resemble the following picture (for as far as this can be shown in ASCII!).
es_es: Se debería parecer a la siguiente figura (¡tanto como se pueda parecer con texto ASCII!).

source: The largest space is occupied by the file text.
es_es: El espacio más grande está ocupado por el archivo de texto.

source: This shows the file in the same way as in a terminal.
es_es: Esto muestra el archivo de una manera similar a una terminal.

source: With some different colors and another font perhaps.
es_es: Con algunas diferencias de tipo de letra y color, quizá.

source: You know how menus work, right?
es_es: Ya sabe como funcionan los menús, ¿no?

source: Vim has the usual items, plus a few more.
es_es: Vim tiene los elementos habituales, además de otros.

source: Browse them to get an idea of what you can use them for.
es_es: Explórelos para tener una idea de cómo podría usarlos.
